Revit 2026 API

# MullionTypeSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MullionTypeSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
MullionTypeSetIterator()
```
```fsharp
new : unit -> MullionTypeSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

MullionTypeSetIterator Class

Autodesk.Revit.DB Namespace